{
  "section1": {
    "title": "Education",
    "description": "- University of Ajou | Suwon | B.S. Software, ~2023"
  },
  "section2": {
    "title": "Skills",
    "projectLink": "View Projects",
    "li1": {
      "title": "- HTML, CSS (medium)",
      "description": "I have essential knowledge to make web application. i am familiar with designing DOM structures or leveraging the properties of elements and i can create simple websites without library like ReactJS."
    },
    "li2": {
      "title": "- Javascript (medium)",
      "description": "I can use basic concepts such as variables, data structures, conditional statements, repeat statements, modules, and contexts without any inconvenience. and i can design algorithms and implement games for simple puzzle games."
    },
    "li3": {
      "title": "- Reactjs (medium)",
      "description": "I can design a scalable component tree to meet client's needs. i am familiar with the use of state and the concept of component life cycle, and I am interested in improving scalability, readability, and performance."
    },
    "li4": {
      "title": "- Nextjs (medium)",
      "description": "I can saparate out the work of react component into server side and client side. i can properly use static HTML serving and server side rendering for each page(route)."
    },
    "li5": {
      "title": "- Threejs (low)",
      "description": "I can make and control the object using threejs. I am very big fan of making beautiful 3D screen with shader."
    }
  },
  "section3": {
    "title": "Employment in Web development",
    "description": "- newbie"
  },
  "section4": {
    "title": "etc",
    "li1": {
      "title": "- Language skills",
      "description": "Super fluent in korean. Not much difficulty in reading English documents. but little in speaking and listening."
    },
    "li2": {
      "title": "- Work style",
      "description": "I do my part with my best. i am very passionate when I work."
    },
    "li3": {
      "title": "- Other Employment",
      "description": "2 years of electronics manufacturing, 3 years as real estate agent"
    },
    "li4": {
      "title": "- Hobby",
      "description": "Tennis | Cooking"
    },
    "li5": {
      "title": "- 2023 goals",
      "description": "Getting Started with Web development | Amateur tennis championship"
    }
  }
}
